wap/services/FootBallService.php

SELECT * FROM `ball_match`
---
    public function index(){
        $data=BallMatch::find()->asArray()->all();