wap/services/MessageService.php

    public function index(){
        $data=Message::find()->asArray()->all();
---
SELECT * FROM `message`